app/controllers/admins_controller.rb

	def index
		@users = User.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:page => params[:page], :per_page => 3)
---
SELECT  "users".* FROM "users"  WHERE (name LIKE '%1140876239%' OR cc LIKE '%1140876239%' OR state LIKE '%1140876239%')  ORDER BY name asc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "users"  WHERE (name LIKE '%1140876239%' OR cc LIKE '%1140876239%' OR state LIKE '%1140876239%')

	def update
		respond_to do |format|
			if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "state" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Andres Vera"], ["state", "desactivado"], ["updated_at", "2015-07-26 08:06:47.722712"]]

	def destroy
		respond_to do |format|
			if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]